Revit 2027 API
ModelPathUtils Methods
The ModelPathUtils type exposes the following members.
Methods
Name | Description
ConvertCloudGUIDsToCloudPath |  Converts a pair of cloud project and model GUIDs to a valid cloud path.
ConvertModelPathToUserVisiblePath |  Gets a string version of the path of a given ModelPath.
ConvertUserVisiblePathToModelPath |  Converts a user-visible path (string) to a ModelPath.
GetAllCloudRegions |  Gets all available regions that are supported by the cloud service. It returns an empty list when something gets wrong. Check the journal to see the error message for further information.
IsValidUserVisibleFullServerPath |  Determines whether the given string represents a valid server path.
Top
See Also
Reference
ModelPathUtils Class
Autodesk.Revit.DB Namespace